# Технологично училище Електронни системи - http://http://www.elsys-bg.org/
# клас : 11б
# номер : 27
# име : Тодор Маноилов
# задача : Да се разработи програма симулираща местата в самолет (27 реда, 2 колони и по 3 места в колона).
# Клас, номер, име, поща, колан, “номер на домашно”, “заглавие на домашното”, “краен срок”, “дата на предаване”,
# “предадено ли е на време”, “връзки към решените задачи”, номер на домашното, заглавие на домашното, краен срок,
# дата на предаване, предадено ли е на време, връзка1, връзка2, връзкаN

class submitted

end
