/*
# Технологично училище Електронни системи - http://http://www.elsys-bg.org/
# 11б клас
# №27
# Тодор Маноилов
# Да се разработи програма, която изисква от потребителя да въведе целочислено число x, където 0<=x<10. Да се инициализира масив от 10 елемента. Да се намерят първите 10 стойности на функцията cos(x) в интервала [0; +∞), в които третата цифра след десетичната запетая е x. Пример при cos(1) = 0.540302306 третата цифра след десетичната запетая е 0. При cos(2) = -0.416146837 третата цифра след десетичната запетая е 6. Намерените стойности да се зададат като стойности на елементите в масива. Елементите на масива да се изведат на стандартния изход.
*/

#include <stdio.h>
#include <math.h>

const size = 10;

int check( double n );

int main(){
	system("clear");
	
	int x;
	double arr[size], n;
	
	do{
		printf("Enter 0<=x<10 : ");
		scanf("%d", &x);
	}while(x<0 || x>=10);
	
	int i,c;
	for(c=0; c<10; c++){
		do{
			n = cos(i);
			i++;
			
		}while(check(n) != x);
		arr[c] = n;
	}
	
	for(i=0; i<10; i++){
		printf("%.4f \n", arr[i]);
	}
	
	return 0;
}

int check( double n ){
	int intN;				
	n *= 1000;
	intN = (int) n;
	return intN % 10;
}

